import React from "react";

const History = () => {
  return (
    <div className="history">
      <h2 className="hheading">ఆలయ సంక్షిప్త చరిత్ర:/History</h2>
      <p>
        కలియుగ దైవము శ్రీ వేంకటేశ్వరుడు అతని కారుణ్యము అపారము ఆ దయాసముద్రుని
        కరుణా పాత్రులైన భక్తుల్లో శ్రీ నందారం నర్సింహులుగారొకరు .
      </p>
      <p>
        అతను సుమారు 40 సం | | లనుండి ఏడుకొండల వెంకన్నను భక్తితో సదా
        దర్శించుచుండేవారు . కాని వార్ధక్యమున తిరుపతి కొండల నెక్కలేక చింతిల్లుచు
        అతి కష్టముగా స్వామిని దర్శించి తన దీనస్థితికి దుఃఖించెను భక్త పరాధీనుడు
        భగవానుడు అనుగ్రహించాడు . వెంటనే స్వప్న సాక్షాత్కారుడై భక్తునింటిముందే
        నిల్చుట కిచ్చగించి యాలయ నిర్మాణమునకై యాజ్ఞనొసంగెను .{" "}
      </p>
      <p>
        భగవదాజ్ఞతో పూర్వ పుణ్య భాగ్యముగా నర్సింహులు సంవత్సరములోనే ఆలయము గట్టించి
        తి . తి . దే . ప్రధాన అర్చకులు శ్రీ పెద్దింటి వెంకటరమణ దీక్షితులవారిని
        ప్రతిష్టాపనకై ప్రార్థించగా ! అపరిచితుడు నర్సింహులు కోరిక వారంగీకరించలేదు
        . విధిబలీయము , పుత్రుడయిన గంగయ్య సహాయంతో దిక్కుదోచక నర్సింహులు రాత్రి
        స్వామీ ! ఇదేమిపరీక్ష ! యని ఖిన్నుడై ప్రార్థించెను .
      </p>
      <p>
        భక్తుని మొరాలకించిన స్వామి ప్రధానార్చకులకు స్వప్న సాక్షాత్కారుడై
        హెచ్చరించి నరసింహుని ప్రార్ధన సఫలము గావించుటకై యాజ్ఞాపించెను .
        తెల్లవారినది దీక్షితులవారు భయ విస్మయముల మేల్కాంచి నరసింహుని కోరిక స్వామి
        కోరికగా నెంచి నరసింహునికై నిరీక్షించెను . ఉదయమే స్నానాదులాచరించి భక్త
        నరసింహులు శ్రీ వేంకటరమణ దీక్షితులవారిని దర్శించి ప్రణమిల్లి
        ప్రతిష్టాపనకై యర్ధించెను . ప్రధానార్చకులాదరముతో అంగీకరించి , సుముహూర్త
        మేర్పరచి , విచ్చేసి శాప్రోక్షముగా వైభవోపేతముగా స్వామిని ప్రతిష్ఠించి
        రెండవ తిరుపతియే ! యన అర్చనాది కార్యములు జరుగుటన్లు తగు చర్చకులనేర్పాటు
        చేసినారు .
      </p>
      <p>
        తిరుమలతిరుపతి దేవస్థానమున ప్రతినిత్యం జరుగు పూజా కార్యక్రమములన్నీ " శ్రీ
        వైఖానసాగమము " ననుసరించి జరుపబడుట వలన , కొడంగల్ శ్రీమహాలక్ష్మీ
        వెంకటేశ్వరస్వామి ఆలయమున " కూడా తిరుమలవలె " శ్రీవైఖానుసాగమం " ప్రకారం
        నిత్యపూజలు , “ సుప్రభాతము నుండి , ఏకాంతసేవ " వరకు నిర్వహింపబడుచున్నవి .
        స్వస్తి శ్రీ సాధారణ నామ సంవత్సర జ్యేష్ఠ బహుళ ఏకాదశి నుండి ఇక్కడి ఆలయమున
        విగ్రహ ప్రతిష్ఠ జరిగినది . నాటి టి . టి . డి . ఆలయ అర్చక మిరాశీదార్ -
        శ్రీశ్రీశ్రీ పెద్దింటి వెంకటరమణ దీక్షితులవారి కరకములములచే స్వామి
        ప్రతిష్ఠ జరిగినది . శ్రీశ్రీశ్రీ మాడంబాకం శ్రీనివాస భట్టాచార్యులు గారు
        యాజీక సారధ్యం వహించినారు . వీరితో పాటు ప్రతిష్ఠా కార్యక్రమమున
        భాగస్వామ్యం వహించిన వైఖానసాగమ విద్వాంసులు , ప్రస్తుతం టి . టి . డి .
        వైఖానసాగమ సలహాదారులు శ్రీశ్రీ శ్రీమాన్ ఎస్ . ఎ . కె . సుందరవరద
        భట్టాచార్యులు గారి ప్రాఫున ఆలయ పూజా కార్యక్రమములన్నియు ఆగమ శాస్తోక్షముగా
        టి . టి . డి . పద్దతిలో నిర్వహింపబడుచున్నవి . ఆలయమున తిరుమలకు వెళ్ళలేని
        పేదలకు " తిరుమలస్వామి వారు " దర్శన భాగ్యమును కటాక్షించి వారి కోరికలను
        తీర్పు ప్రభావముగలవాడై పేదలకు కొంగు బంగారమై విలసిల్లినాడు
      </p>
    </div>
  );
};

export default History;
